### Importing a liabraries

In [1]:
import pandas as pd
import sqlalchemy as alch

### Create a Python connection with SQL database 
Let's introduce the password

In [2]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

Set the database, and create the connection calling the variable engine.

In [3]:
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

### ACTIVITY 1: Queries

#### 1. Creating seperate dataframe for rentals for the month of May

In [5]:
rentals_may = pd.read_sql_query(
"""
SELECT * FROM rental WHERE MONTH(rental_date) = 5;
""", engine
)
rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
len(rentals_may)

1156

 - **Check the number of rentals for each customer for May**

In [7]:
rentals_may_unique = pd.read_sql_query(
"""
SELECT distinct(customer_id), count(*) as 'no_of_rentals' \
FROM rentals_may \
GROUP BY customer_id \
ORDER BY no_of_rentals DESC;
""", engine
)
rentals_may_unique.head()

   customer_id  no_of_rentals
0          197              8
1          506              7
2          109              7
3          269              6
4          239              6

In [8]:
len(rentals_may_unique)

520

#### 2. Creating seperate dataframe for rentals for the month of June

In [9]:
rentals_june = pd.read_sql_query(
"""
SELECT * FROM rental WHERE MONTH(rental_date) = 6;
""", engine
)
rentals_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [10]:
len(rentals_june)

2311

 - **Check the number of rentals for each customer for June**

In [11]:
rentals_june_unique = pd.read_sql_query(
"""
SELECT distinct(customer_id), count(*) as 'no_of_rentals' \
FROM rentals_june \
GROUP BY customer_id \
ORDER BY no_of_rentals DESC;
""", engine
)
rentals_june_unique.head()

   customer_id  no_of_rentals
0           31             11
1          454             10
2          329              9
3          295              9
4          561              9

In [12]:
len(rentals_june_unique)

590

#### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

 - Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [32]:
# performing Inner-join to make sure get the customers who has rented the movies for the month of May AND June.
rental_may_june_dfi = rentals_may_unique.merge(rentals_june_unique, how='inner', on='customer_id')

In [35]:
rental_may_june_dfi.head()

   customer_id  no_of_rentals_x  no_of_rentals_y
0          197                8                8
1          506                7                5
2          109                7                5
3          269                6                3
4          239                6                5

**Renaming a column names for better readability**

In [36]:
rental_may_june_dfi = rental_may_june_dfi.rename(columns={"no_of_rentals_x":"rentals_may","no_of_rentals_y":"rentals_june"})
rental_may_june_dfi.head()

   customer_id  rentals_may  rentals_june
0          197            8             8
1          506            7             5
2          109            7             5
3          269            6             3
4          239            6             5

In [37]:
len(rental_may_june_dfi)

512

In [38]:
rental_may_june_dfi.isna().sum()

customer_id     0
rentals_may     0
rentals_june    0
dtype: int64

In [44]:
# Solution 1
def max_rental(x):
    if x['rentals_may'] > x['rentals_june']:
        return "May"
    if x['rentals_may'] == x['rentals_june']:
        return "Equal"
    return "June"

rental_may_june_dfi['max_rental'] = rental_may_june_dfi.apply(max_rental, axis=1)

In [46]:
rental_may_june_dfi.head(20)

    customer_id  rentals_may  rentals_june max_rental
0           197            8             8      Equal
1           506            7             5        May
2           109            7             5        May
3           269            6             3        May
4           239            6             5        May
5            19            6             3        May
6           371            6             7       June
7           207            6             1        May
8           245            6             3        May
9            53            6             5        May
10          274            6             2        May
11          251            6             3        May
12          596            6             2        May
13          161            6             2        May
14          222            5             2        May
15          575            5             3        May
16           44            5             4        May
17            7            5             5      Equal
18          256            5             7       June
19          569            5             2        May

In [61]:
# Solution 2
def max_rental_month(id):
    for i in range (0,len(rental_may_june_dfi['customer_id'])):
        if rental_may_june_dfi['customer_id'][i] == id:
            if rental_may_june_dfi['rentals_may'][i] > rental_may_june_dfi['rentals_june'][i]:
                print("Customer id ",id, " rented more films in May.")
            elif rental_may_june_dfi['rentals_may'][i] < rental_may_june_dfi['rentals_june'][i]:
                print("Customer id ",id, " rented more films in June.")
            else:
                print("Customer id ",id, " rented same amount of films in the month of May & June.")

In [62]:
max_rental_month(371)

Customer id  371  rented more films in June.